cavity3/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

dx1     0;
dx2     5;

dz1      0;
dz2     -1;
dz3      1;
dz4      2;

dy1      0;
dy2      1;
dy3      1.5;
dy4      2.5;



vertices
(
    //vertices da face esquerda externa
    ($dx1 $dy1 $dz2) // 0
    ($dx2 $dy1 $dz2) // 1
    ($dx2 $dy2 $dz2) // 2
    ($dx1 $dy2 $dz2) // 3
    
    ($dx2 $dy3 $dz2) // 4
    ($dx1 $dy3 $dz2) // 5
    ($dx2 $dy4 $dz2) // 6
    ($dx1 $dy4 $dz2) // 7

//vertices da face esquerda interna
    ($dx1 $dy1 $dz1) // 8
    ($dx2 $dy1 $dz1) // 9
    ($dx2 $dy2 $dz1) // 10
    ($dx1 $dy2 $dz1) // 11
    
    ($dx2 $dy3 $dz1) // 12
    ($dx1 $dy3 $dz1) // 13
    ($dx2 $dy4 $dz1) // 14
    ($dx1 $dy4 $dz1) // 15

//vertices da face direita interna
    ($dx1 $dy1 $dz3) // 16
    ($dx2 $dy1 $dz3) // 17
    ($dx2 $dy2 $dz3) // 18
    ($dx1 $dy2 $dz3) // 19

    ($dx2 $dy3 $dz3) // 20
    ($dx1 $dy3 $dz3) // 21
    ($dx2 $dy4 $dz3) // 22
    ($dx1 $dy4 $dz3) // 23
   
    //vertices da face direita externa
    ($dx1 $dy1 $dz4) // 24
    ($dx2 $dy1 $dz4) // 25
    ($dx2 $dy2 $dz4) // 26
    ($dx1 $dy2 $dz4) // 27
    
    ($dx2 $dy3 $dz4) // 28
    ($dx1 $dy3 $dz4) // 29
    ($dx2 $dy4 $dz4) // 30
    ($dx1 $dy4 $dz4) // 31
    
);

blocks
(
    hex (0 1 6 7 8 9 14 15) (10 10 10) simpleGrading (1 1 1)
    hex (3 2 4 5 11 10 12 13) (10 10 10) simpleGrading (1 1 1)
    hex (5 4 6 7 13 12 14 15) (10 10 10) simpleGrading (1 1 1)


    hex (16 17 18 19 24 25 26 27) (10 10 10) simpleGrading (1 1 1)
    hex (19 18 20 21 27 26 28 29) (10 10 10) simpleGrading (1 1 1)
    hex (21 20 22 23 29 28 30 31) (10 10 10) simpleGrading (1 1 1)
    //
    hex (8 9 10 11 16 17 18 19) (10 10 10) simpleGrading (1 1 1)
    hex (13 12 14 15 21 20 22 23) (10 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet //entrada
    {
        type patch;
        faces
        (
            (0 8 11 3)
            (3 11 13 5)
            (5 13 15 7)
            (8 16 19 11)
            (13 21 23 15)
            (16 24 27 19)
            (19 27 29 21)
            (21 29 31 23)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 10 9)
            (2 4 12 10)
            (4 6 14 12) //
            (9 10 18 17)
            (12 14 22 20)
            (17 18 26 25)
            (18 20 28 26)
            (20 22 30 28)

        );
    }
    walls
    {
        type wall;
        faces
        (
            (7 15 14 6)  // top
            (15 23 22 14)
            (23 31 30 22)
            
            (0 1 9 8)    //bottom 
            (8 9 17 16)  //bottom
            (16 17 25 24)     // bottom


            (25 26 27 24) //right
            (26 28 29 27) //right
            (28 30 31 29) //right

            (0 3 2 1) //left
            (3 5 4 2) //left
            (5 7 6 4) //left
            ///
            (19 21 20 18)
            (11 10 12 13)
            //
            (13 12 20 21)
            (11 19 18 10)
        );
    }
    

    
    
);

mergePatchPairs
(
);

// ************************* //
